<?php
return [
    'role_management' => [
        'title' => 'Управление ролями и разрешениями',
        'content' => [
            'step1' => "Для начала работы перейдите в раздел <strong>«Пакеты разрешений»</strong>.",
            'step2' => "В разделе <strong>«Пакеты разрешений»</strong> задайте имя новому пакету и выберите необходимые разрешения.",
            'step3' => "При наличии всех разрешений пользователь автоматически получит статус <strong>«Модератор»</strong>.",
            'step4' => "Активация переключателя <strong>«Администратор»</strong> предоставляет уникальные права (подробнее в статье «Уникальные права»).",
            'step5' => "В случае активации переключателя <strong>«Администратор»</strong> Администратор получает все базовые разрешения автоматически.",
            'step6' => "После создания пакета перейдите в раздел <strong>«Роли»</strong>.",
            'step7' => "В разделе <strong>«Роли»</strong> укажите имя новой роли и выберите пакет разрешений.",
            'step8' => "Один пакет разрешений может быть закреплен за несколькими ролями.",
            'step9' => "Изменения вступают в силу немедленно после создания роли.",
            'step10' => "Назначьте роль пользователю в разделе <strong>«Пользователи»</strong> для немедленного применения прав."
        ]
    ]
];
